kGooch
Gooch, A., Gooch, B., Shirley, P., and Cohen, E. 1998.
A non-photorealistic lighting model for automatic technical
illustration.  In proceedings of the 25th Annual Conference
on Computer Graphics and Interactive Techniques SIGGRAPH '98.
ACM Press, New York, NY, 447-452.